{"id": "consumer_dispute.txt__chunk0", "text": "CRIME CATEGORY: CONSUMER DISPUTE 1. DESCRIPTION: Defective goods or deficient service. 2. STEPS: - Contact seller support. - Escalate to grievance officer. - File complaint: https://consumerhelpline.gov.in. 3. SECTIONS: - Consumer Protection Act 2019. 4. PROCEDURE: - File case via https://edaakhil.nic.in. 5. EVIDENCE: - Invoice, chats, photos. 6. CONTACT: - NCH: 1800-11-4000 / 1915", "meta": {"source_name": "consumer_dispute.txt", "url": "", "date_published": "", "jurisdiction": "", "doc_type": "", "city": "", "incident_type": ""}}
{"id": "fake_job_scam.txt__chunk0", "text": "CRIME CATEGORY: FAKE JOB PORTAL / WORK-FROM-HOME SCAM 1. CRIME DESCRIPTION: Fraudulent job offers requesting registration fees. 2. STEPS: - Stop contact and report to https://cybercrime.gov.in. - Inform bank to investigate recovery. 3. SECTIONS: - BNS 318 (formerly IPC 420) Cheating. - IT Act 66D. 4. FIR: - File complaint online and then local Cyber Cell. 5. EVIDENCE: - Payment receipt, ads, chats. 6. CONTACT: - Cyber Helpline: 1930", "meta": {"source_name": "fake_job_scam.txt", "url": "", "date_published": "", "jurisdiction": "", "doc_type": "", "city": "", "incident_type": ""}}
{"id": "hit_and_run.txt__chunk0", "text": "CRIME CATEGORY: HIT AND RUN 1. DESCRIPTION: Driver flees after causing accident. 2. STEPS: - Call 112; record vehicle details. 3. SECTIONS: - BNS and Motor Vehicles Act (negligent driving provisions). 4. FIR: - File at local police or Zero FIR. 5. EVIDENCE: - Photos, CCTV, witness contacts. 6. CONTACT: - 112 / 108 / Traffic Police", "meta": {"source_name": "hit_and_run.txt", "url": "", "date_published": "", "jurisdiction": "", "doc_type": "", "city": "", "incident_type": ""}}
{"id": "online_blackmail_extortion.txt__chunk0", "text": "CRIME CATEGORY: ONLINE BLACKMAIL / EXTORTION 1. DESCRIPTION: Threats demanding money to avoid release of personal content. 2. STEPS: - Do not pay. - Save chat/call logs. - Report at https://cybercrime.gov.in. 3. SECTIONS: - BNS 349 (Extortion) - BNS 351 (Criminal Intimidation) - IT Act 67A/67B (if sexual content) 4. FIR: - Zero FIR allowed at any police station. 5. EVIDENCE: - Screenshots, calls, account links. 6. CONTACT: - 1930 / 112", "meta": {"source_name": "online_blackmail_extortion.txt", "url": "", "date_published": "", "jurisdiction": "", "doc_type": "", "city": "", "incident_type": ""}}
{"id": "otp_theft.txt__chunk0", "text": "CRIME CATEGORY: OTP THEFT / FAKE VERIFICATION CALL 1. CRIME DESCRIPTION: Scammers pretend to be bank/company officials and ask for OTP to gain account access. 2. IMMEDIATE STEPS: - Do not share OTP. - Change banking/email passwords. - Call your bank to freeze your account temporarily. 3. LEGAL SECTIONS: - IT Act 66C (Identity Theft) - IT Act 66D (Electronic Impersonation) - BNS 316 (formerly IPC 419) Impersonation. 4. FIR PROCEDURE: - File complaint on https://cybercrime.gov.in. - Visit Police Station to convert to FIR. 5. EVIDENCE TO COLLECT: - Call logs, screenshots, SMS alerts. 6. CONTACT: - Cyber Helpline: 1930 - Police: 112", "meta": {"source_name": "otp_theft.txt", "url": "", "date_published": "", "jurisdiction": "", "doc_type": "", "city": "", "incident_type": ""}}
{"id": "social_media_hacking.txt__chunk0", "text": "CRIME CATEGORY: SOCIAL MEDIA ACCOUNT HACKING 1. DESCRIPTION: Unauthorized access to social media accounts. 2. IMMEDIATE STEPS: - Reset password and enable two-factor authentication. - Report account as hacked in platform support. 3. SECTIONS: - IT Act 66C, 66D - BNS 336 (Defamation if misuse) 4. FIR: - File complaint at https://cybercrime.gov.in. 5. EVIDENCE: - Login logs and screenshots. 6. CONTACT: - Cyber Helpline: 1930", "meta": {"source_name": "social_media_hacking.txt", "url": "", "date_published": "", "jurisdiction": "", "doc_type": "", "city": "", "incident_type": ""}}
{"id": "traffic_violation.txt__chunk0", "text": "CRIME CATEGORY: TRAFFIC VIOLATION 1. DESCRIPTION: Speeding, no helmet, signal jump. 2. STEPS: - Request official challan receipt. 3. SECTIONS: - Motor Vehicles Act 4. FIR: - Only if injury/death; else challan. 5. CONTACT: - 112 / Local Traffic Police", "meta": {"source_name": "traffic_violation.txt", "url": "", "date_published": "", "jurisdiction": "", "doc_type": "", "city": "", "incident_type": ""}}
{"id": "upi_payment_fraud.txt__chunk0", "text": "CRIME CATEGORY: UPI PAYMENT FRAUD 1. CRIME DESCRIPTION: This incident occurs when a scammer tricks a person into sending money using UPI apps such as Google Pay, PhonePe, Paytm, or BHIM. The fraud often involves fake payment screenshots, misleading “collect request” notifications, or impersonation. 2. IMMEDIATE STEPS (ACTION ROADMAP): - Contact your bank and request transaction hold. - Report the fraud via https://cybercrime.gov.in. - Call Cyber Helpline 1930 to register the case. - Change UPI PIN and secure bank passwords. 3. APPLICABLE BNS / IPC / OTHER LEGAL SECTIONS: - BNS 318 (formerly IPC 420) Cheating. - BNS 314 (formerly IPC 417) Simple Cheating. - IT Act 66D: Impersonation using electronic means. 4. FIR PROCEDURE: - Submit online complaint at https://cybercrime.gov.in. - Then visit Police Station/Cyber Cell to convert to FIR. 5. EVIDENCE TO COLLECT: - Transaction ID, chat history, screenshots, bank statement. 6. AUTHORITIES TO CONTACT: - Cyber Helpline: 1930 - National Cyber Crime Portal: https://cybercrime.gov.in 7. MAIL DRAFT: Subject: Complaint About UPI Fraud Transaction I, <Name>, was defrauded of Rs. <Amount> by UPI transaction on <Date>. Evidence attached. Please take action.", "meta": {"source_name": "upi_payment_fraud.txt", "url": "", "date_published": "", "jurisdiction": "", "doc_type": "", "city": "", "incident_type": ""}}
